** Add 2 columns of Hex Numbers and Display

#+BEGIN_SRC org
| 0x10 | 0x0 |  16 | 10 |
| 0x20 | 0x1 |  33 | 21 |
| 0x30 | 0x2 |  50 | 32 |
| 0xf0 | 0xf | 255 | FF |
#+TBLFM: $3='(+ (string-to-number (substring $2 2) 16) (string-to-number (substring $1 2) 16))::$4='(format "%X" (string-to-number $3))
#+END_SRC

***** Default behavior

#+NAME: ex1-table-one-hline-default
#+begin_src elisp :var data=ex1-table-one-hline :exports both
  data
#+end_src

#+RESULTS: ex1-table-one-hline-default
| Value 0 |
| Value 1 |
| Value 2 |
| Value 3 |

***** Added =:colnames yes=
#+NAME: ex1-table-one-hline-added-colnames-yes
#+begin_src elisp :var data=ex1-table-one-hline :colnames yes  
  data
#+end_src

#+RESULTS: ex1-table-one-hline-added-colnames-yes
| Column_Header |
|---------------|
| Value 0       |
| Value 1       |
| Value 2       |
| Value 3       |

***** Default behavior

#+NAME: ex1-table-two-hline-default
#+begin_src elisp :var data=ex1-table-two-hline  :exports both
  data
#+end_src

#+RESULTS: ex1-table-two-hline-default
| Column_Header |
| Value 0       |
| Value 1       |
| Value 2       |
| Value 3       |

***** Added =:colnames yes=

#+NAME: ex1-table-two-hline-added-colnames-yes
#+begin_src elisp :var data=ex1-table-two-hline :colnames yes  :exports both
  data
#+end_src

#+RESULTS: ex1-table-two-hline-added-colnames-yes
| Column_Header |
|---------------|
| Value 0       |
| Value 1       |
| Value 2       |
| Value 3       |

***** Added =hlines yes=

#+NAME: ex1-table-two-hline-added-hlines-yes
#+begin_src elisp :var data=ex1-table-two-hline :hlines yes   :exports both
  data
#+end_src

#+RESULTS: ex1-table-two-hline-added-hlines-yes
| Column_Header |
|---------------|
| Value 0       |
| Value 1       |
| Value 2       |
| Value 3       |
|---------------|

***** Added both =:colnames yes= and =hlines yes=

#+NAME: ex1-table-two-hline-added-both-colnames-hlines-yes
#+begin_src elisp :var data=ex1-table-two-hline :colnames yes :hlines yes   :exports both
  data
#+end_src

#+RESULTS: ex1-table-two-hline-added-both-colnames-hlines-yes
| Column_Header |
|---------------|
| Value 0       |
| Value 1       |
| Value 2       |
| Value 3       |
|---------------|

** Indexable Variable Values Examples

#+NAME: 3D
#+BEGIN_SRC emacs-lisp :exports both
  '( 
    ( ;;3D[0,,]
      ( ;;3D[0,0,]
        1 ;;3D[0,0,0]
        2 ;;3D[0,0,1]
        3 ;;3D[0,0,2]
      ) 
      ( ;;3D[0,1,]
        4 ;;3D[0,1,0]
        5 ;;3D[0,1,1]
        6 ;;3D[0,1,2]
      ) 
      ( ;;3D[0,2,]
        7 ;;3D[0,2,0]
        8 ;;3D[0,2,1]
        9 ;;3D[0,2,2]
      )
    )
    ( ;;3D[1,,]
     ( ;;3D[1,0,]
       10 ;;3D[1,0,0]
       11 ;;3D[1,0,1]
       12 ;;3D[1,0,2]
     ) 
     ( ;;3D[1,1,]
       13 ;;3D[1,1,0]
       14 ;;3D[1,1,1]
       15  ;;3D[1,1,2]
     ) 
     ( ;;3D[1,2,]
       16 ;;3D[1,2,0]
       17 ;;3D[1,2,1]
       18  ;;3D[1,2,2]
     )
    )
   ( ;;3D[2,,]
     ( ;;3D[2,0,]
       19 ;;3D[2,0,0]
       20 ;;3D[2,0,1]
       21 ;;3D[2,0,2]
     ) 
     ( ;;3D[2,1,]
       22 ;;3D[2,1,0]
       23 ;;3D[2,1,1]
       24 ;;3D[2,1,2]
     ) 
     ( ;;3D[2,2,]
       25 ;;3D[2,2,0]
       26 ;;3D[2,2,1]
       27 ;;3D[2,2,2]
     )
   )
  )
#+END_SRC

#+RESULTS: 3D
| (1 2 3)    | (4 5 6)    | (7 8 9)    |
| (10 11 12) | (13 14 15) | (16 17 18) |
| (19 20 21) | (22 23 24) | (25 26 27) |

#+BEGIN_SRC org
  ,#+BEGIN_SRC emacs-lisp :var data=3D[1,,1]
    data
  ,#+END_SRC

  ,#+RESULTS:
  | 11 | 14 | 17 |

  
  ,#+BEGIN_SRC emacs-lisp :var data=3D[0,,1]
    data
  ,#+END_SRC

  ,#+RESULTS:
  | 2 | 5 | 8 |

  ,#+BEGIN_SRC emacs-lisp :var data=3D[0,,0]
    data
  ,#+END_SRC

  ,#+RESULTS:
  | 1 | 4 | 7 |

  ,#+BEGIN_SRC emacs-lisp :var data=3D[2,,0]
    data
  ,#+END_SRC

  ,#+RESULTS:
  | 19 | 22 | 25 |
#+END_SRC


* Does ~#+ATTR_HTML:~ syntax render in GitHub? Not yet.

#+BEGIN_SRC org :results raw replace :exports both
  ,#+ATTR_HTML: :title The Org mode homepage :style color:red;
  [[http://orgmode.org]]
#+END_SRC

#+RESULTS:
#+ATTR_HTML: :title The Org mode homepage :style color:red;
[[http://orgmode.org]]

